Q1
CODE:
IDENTIFICATION DIVISION.                 
PROGRAM-ID. COBWRU.                      
DATA DIVISION.                           
WORKING-STORAGE SECTION.                 
   COPY DFHAID.                          
01 EMP-REC.                              
  02 EMP-NO PIC 9(3).                    
  02 EMP-NAME PIC X(3).                  
  02 EMP-SAL PIC 9(6)                    
  02 EMP-LOC PIC X(5).                   
77 WS-RESPC PIC S9(8) COMP.              
77 WS-STR PIC X(20).                     
PROCEDURE DIVISION.                                                       
    MOVE 101 TO EMP-NO. 
    MOVE 'RUS' TO EMP-ENAME.
	MOVE 556789 TO EMP-SAL.
    MOVE 'PUN' TO EMP-LOC.	     
    EXEC CICS WRITEQ TS                          
        QUEUE('EMPDATA') 
        FROM(EMP-REC)		
        LENGTH(LENGTH OF EMP-REC)                                  
        MAIN                     
        RESP(WS-RESPC)                       
    END-EXEC.                                
    IF (WS-RESPC) = DFHRESP(NORMAL)          
        EXEC CICS SEND TEXT                  
            FROM('INSERTED DATA TO TSQ')       
        END-EXEC                             
    ELSE                                     
        MOVE 'NOT ABLE TO INSERT TO WS-STR    
        EXEC CICS SEND TEXT                  
            FROM(WS-STR)                     
        END-EXEC                             
    END-IF.                                  
    EXEC CICS                                
        RETURN                               
    END-EXEC.                                		