Q1. 
IDENTIFICATION DIVISION.
PROGRAM-ID. CICSPGM1.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(40).
PROCEDURE DIVISION.
0000-MAIN-PARA.
   MOVE 'WELCOME TO CICS' TO WS-MESSAGE
   EXEC CICS 
      SEND TEXT FROM (WS-MESSAGE)
   END-EXEC
   EXEC CICS
      RETURN
   END-EXEC.
   
Q2.
IDENTIFICATION DIVISION.
PROGRAM-ID. CICSPGM1.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 NAME PIC X(20).
PROCEDURE DIVISION.
0000-MAIN-PARA.
   ACCEPT NAME.
   IF LENGTH OF NAME > 0
	   EXEC CICS 
		  SEND TEXT FROM ('WELCOME')
	   END-EXEC
   END-IF.
   EXEC CICS
	  RETURN
   END-EXEC
   
Q3.
IDENTIFICATION DIVISION.
PROGRAM-ID. CICSPGM1.
DATA DIVISION.
FILE SECTION.
WORKING-STORAGE SECTION.
77 NUM1 PIC 99.
77 NUM2 PIC 99.
77 TOT PIC 999.
01 WS-MESSAGE PIC X(5).
PROCEDURE DIVISION.
0000-MAIN-PARA.
   ACCEPT NUM1.
   ACCEPT NUM2.
   COMPUTE TOT = NUM1 + NUM2.
   MOVE TOT TO WS-MESSAGE.
   EXEC CICS 
      SEND TEXT FROM (WS-MESSAGE)
   END-EXEC
   EXEC CICS
      RETURN
   END-EXEC.